doc/resources/benchmark_sysbench/threads8_sysbench-tpcc-noneproxy.txt
 date +%FT%TZ; \
> ./tpcc.lua --mysql-host=* --mysql-port=* --mysql-user=* --mysql-password=* \
> --mysql-db=sbt --report-interval=10 --tables=8 --scale=400 --db-driver=mysql --time=900 --threads=8 run; \
> date +%FT%TZ;
2020-04-27T04:09:35Z
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 198.37 qps: 5584.87 (r/w/o: 2550.48/2634.46/399.93) lat (ms,95%): 77.19 err/s 1.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 186.90 qps: 5308.29 (r/w/o: 2418.84/2515.64/373.81) lat (ms,95%): 142.39 err/s 1.20 reconn/s: 0.00
[ 30s ] thds: 8 tps: 191.20 qps: 5286.38 (r/w/o: 2412.39/2491.59/382.40) lat (ms,95%): 94.10 err/s 0.80 reconn/s: 0.00
[ 40s ] thds: 8 tps: 195.10 qps: 5624.75 (r/w/o: 2565.12/2669.42/390.20) lat (ms,95%): 80.03 err/s 0.70 reconn/s: 0.00
[ 50s ] thds: 8 tps: 191.50 qps: 5449.48 (r/w/o: 2485.09/2581.39/383.00) lat (ms,95%): 81.48 err/s 0.70 reconn/s: 0.00
[ 60s ] thds: 8 tps: 190.10 qps: 5304.69 (r/w/o: 2420.20/2504.30/380.20) lat (ms,95%): 89.16 err/s 0.60 reconn/s: 0.00
[ 70s ] thds: 8 tps: 195.90 qps: 5647.27 (r/w/o: 2580.19/2675.29/391.80) lat (ms,95%): 77.19 err/s 0.60 reconn/s: 0.00
[ 80s ] thds: 8 tps: 190.30 qps: 5474.41 (r/w/o: 2495.90/2597.90/380.60) lat (ms,95%): 81.48 err/s 0.80 reconn/s: 0.00
[ 90s ] thds: 8 tps: 188.50 qps: 5493.51 (r/w/o: 2505.40/2611.10/377.00) lat (ms,95%): 81.48 err/s 1.20 reconn/s: 0.00
[ 100s ] thds: 8 tps: 192.10 qps: 5404.63 (r/w/o: 2460.11/2560.31/384.20) lat (ms,95%): 84.47 err/s 1.30 reconn/s: 0.00
[ 110s ] thds: 8 tps: 193.90 qps: 5432.97 (r/w/o: 2480.89/2564.29/387.80) lat (ms,95%): 81.48 err/s 0.90 reconn/s: 0.00
[ 120s ] thds: 8 tps: 201.60 qps: 5729.09 (r/w/o: 2616.80/2709.10/403.20) lat (ms,95%): 77.19 err/s 0.90 reconn/s: 0.00
[ 130s ] thds: 8 tps: 204.30 qps: 5817.87 (r/w/o: 2654.83/2754.43/408.60) lat (ms,95%): 75.82 err/s 0.90 reconn/s: 0.00
[ 140s ] thds: 8 tps: 189.30 qps: 5362.81 (r/w/o: 2448.10/2536.10/378.60) lat (ms,95%): 123.28 err/s 0.40 reconn/s: 0.00
[ 150s ] thds: 8 tps: 199.00 qps: 5527.47 (r/w/o: 2523.79/2605.69/398.00) lat (ms,95%): 80.03 err/s 1.30 reconn/s: 0.00
[ 160s ] thds: 8 tps: 184.40 qps: 5341.51 (r/w/o: 2437.60/2535.11/368.80) lat (ms,95%): 125.52 err/s 0.80 reconn/s: 0.00
[ 170s ] thds: 8 tps: 204.80 qps: 5775.82 (r/w/o: 2635.91/2730.31/409.60) lat (ms,95%): 75.82 err/s 0.90 reconn/s: 0.00
[ 180s ] thds: 8 tps: 195.30 qps: 5621.79 (r/w/o: 2566.50/2664.70/390.60) lat (ms,95%): 78.60 err/s 0.70 reconn/s: 0.00
[ 190s ] thds: 8 tps: 191.60 qps: 5362.28 (r/w/o: 2447.59/2531.49/383.20) lat (ms,95%): 92.42 err/s 0.90 reconn/s: 0.00
[ 200s ] thds: 8 tps: 194.20 qps: 5548.62 (r/w/o: 2527.31/2632.91/388.40) lat (ms,95%): 94.10 err/s 1.00 reconn/s: 0.00
[ 210s ] thds: 8 tps: 185.60 qps: 5244.80 (r/w/o: 2392.40/2481.20/371.20) lat (ms,95%): 125.52 err/s 1.10 reconn/s: 0.00
[ 220s ] thds: 8 tps: 186.60 qps: 5324.50 (r/w/o: 2437.80/2513.50/373.20) lat (ms,95%): 116.80 err/s 0.70 reconn/s: 0.00
[ 230s ] thds: 8 tps: 193.00 qps: 5471.79 (r/w/o: 2487.40/2598.40/386.00) lat (ms,95%): 99.33 err/s 0.50 reconn/s: 0.00
[ 240s ] thds: 8 tps: 198.30 qps: 5619.72 (r/w/o: 2566.81/2656.31/396.60) lat (ms,95%): 81.48 err/s 0.80 reconn/s: 0.00
[ 250s ] thds: 8 tps: 195.60 qps: 5372.08 (r/w/o: 2444.59/2536.29/391.20) lat (ms,95%): 106.75 err/s 1.00 reconn/s: 0.00
[ 260s ] thds: 8 tps: 191.30 qps: 5441.71 (r/w/o: 2475.70/2583.40/382.60) lat (ms,95%): 90.78 err/s 1.10 reconn/s: 0.00
[ 270s ] thds: 8 tps: 191.80 qps: 5479.92 (r/w/o: 2505.41/2590.91/383.60) lat (ms,95%): 84.47 err/s 0.90 reconn/s: 0.00
[ 280s ] thds: 8 tps: 187.40 qps: 5337.27 (r/w/o: 2431.48/2530.98/374.80) lat (ms,95%): 147.61 err/s 0.70 reconn/s: 0.00
[ 290s ] thds: 8 tps: 189.90 qps: 5550.13 (r/w/o: 2523.52/2646.82/379.80) lat (ms,95%): 95.81 err/s 0.80 reconn/s: 0.00
[ 300s ] thds: 8 tps: 197.60 qps: 5506.71 (r/w/o: 2520.20/2591.30/395.20) lat (ms,95%): 95.81 err/s 1.00 reconn/s: 0.00
[ 310s ] thds: 8 tps: 188.20 qps: 5469.19 (r/w/o: 2495.30/2597.50/376.40) lat (ms,95%): 97.55 err/s 0.70 reconn/s: 0.00
[ 320s ] thds: 8 tps: 193.60 qps: 5574.38 (r/w/o: 2534.99/2652.19/387.20) lat (ms,95%): 97.55 err/s 0.60 reconn/s: 0.00
[ 330s ] thds: 8 tps: 187.00 qps: 5223.49 (r/w/o: 2383.80/2465.70/374.00) lat (ms,95%): 116.80 err/s 1.00 reconn/s: 0.00
[ 340s ] thds: 8 tps: 192.10 qps: 5496.79 (r/w/o: 2506.90/2605.70/384.20) lat (ms,95%): 101.13 err/s 0.60 reconn/s: 0.00
[ 350s ] thds: 8 tps: 190.90 qps: 5486.01 (r/w/o: 2506.30/2597.90/381.80) lat (ms,95%): 108.68 err/s 0.60 reconn/s: 0.00
[ 360s ] thds: 8 tps: 191.00 qps: 5543.01 (r/w/o: 2525.31/2635.71/382.00) lat (ms,95%): 101.13 err/s 0.90 reconn/s: 0.00
[ 370s ] thds: 8 tps: 191.50 qps: 5417.63 (r/w/o: 2471.81/2562.81/383.00) lat (ms,95%): 94.10 err/s 1.40 reconn/s: 0.00
[ 380s ] thds: 8 tps: 197.00 qps: 5424.79 (r/w/o: 2475.69/2555.09/394.00) lat (ms,95%): 99.33 err/s 0.30 reconn/s: 0.00
[ 390s ] thds: 8 tps: 192.70 qps: 5347.00 (r/w/o: 2437.10/2524.50/385.40) lat (ms,95%): 110.66 err/s 1.10 reconn/s: 0.00
[ 400s ] thds: 8 tps: 185.80 qps: 5154.20 (r/w/o: 2354.50/2428.10/371.60) lat (ms,95%): 134.90 err/s 1.20 reconn/s: 0.00
[ 410s ] thds: 8 tps: 194.50 qps: 5503.63 (r/w/o: 2515.77/2599.06/388.79) lat (ms,95%): 95.81 err/s 1.00 reconn/s: 0.00
[ 420s ] thds: 8 tps: 192.30 qps: 5288.50 (r/w/o: 2417.00/2486.70/384.80) lat (ms,95%): 94.10 err/s 1.00 reconn/s: 0.00
[ 430s ] thds: 8 tps: 194.80 qps: 5549.29 (r/w/o: 2531.60/2628.10/389.60) lat (ms,95%): 84.47 err/s 0.80 reconn/s: 0.00
[ 440s ] thds: 8 tps: 188.90 qps: 5344.77 (r/w/o: 2435.23/2531.73/377.80) lat (ms,95%): 108.68 err/s 0.90 reconn/s: 0.00
[ 450s ] thds: 8 tps: 191.30 qps: 5420.60 (r/w/o: 2470.90/2567.20/382.50) lat (ms,95%): 104.84 err/s 0.90 reconn/s: 0.00
[ 460s ] thds: 8 tps: 195.10 qps: 5697.98 (r/w/o: 2598.79/2708.89/390.30) lat (ms,95%): 80.03 err/s 0.40 reconn/s: 0.00
[ 470s ] thds: 8 tps: 195.80 qps: 5462.41 (r/w/o: 2487.91/2582.91/391.60) lat (ms,95%): 90.78 err/s 0.70 reconn/s: 0.00
[ 480s ] thds: 8 tps: 192.90 qps: 5453.49 (r/w/o: 2483.10/2584.60/385.80) lat (ms,95%): 94.10 err/s 1.20 reconn/s: 0.00
[ 490s ] thds: 8 tps: 192.90 qps: 5492.70 (r/w/o: 2501.50/2605.40/385.80) lat (ms,95%): 84.47 err/s 0.70 reconn/s: 0.00
[ 500s ] thds: 8 tps: 190.90 qps: 5613.12 (r/w/o: 2562.91/2668.41/381.80) lat (ms,95%): 90.78 err/s 0.70 reconn/s: 0.00
[ 510s ] thds: 8 tps: 194.10 qps: 5545.49 (r/w/o: 2533.70/2623.60/388.20) lat (ms,95%): 81.48 err/s 0.90 reconn/s: 0.00
[ 520s ] thds: 8 tps: 198.90 qps: 5647.30 (r/w/o: 2573.80/2675.70/397.80) lat (ms,95%): 81.48 err/s 0.80 reconn/s: 0.00
[ 530s ] thds: 8 tps: 199.20 qps: 5575.20 (r/w/o: 2540.50/2636.30/398.40) lat (ms,95%): 84.47 err/s 0.70 reconn/s: 0.00
[ 540s ] thds: 8 tps: 195.60 qps: 5484.90 (r/w/o: 2496.40/2597.30/391.20) lat (ms,95%): 90.78 err/s 1.10 reconn/s: 0.00
[ 550s ] thds: 8 tps: 188.60 qps: 5424.11 (r/w/o: 2480.40/2566.50/377.20) lat (ms,95%): 97.55 err/s 1.00 reconn/s: 0.00
[ 560s ] thds: 8 tps: 188.90 qps: 5441.17 (r/w/o: 2490.39/2572.99/377.80) lat (ms,95%): 89.16 err/s 1.00 reconn/s: 0.00
[ 570s ] thds: 8 tps: 198.10 qps: 5726.82 (r/w/o: 2614.01/2716.61/396.20) lat (ms,95%): 80.03 err/s 0.70 reconn/s: 0.00
[ 580s ] thds: 8 tps: 191.80 qps: 5423.49 (r/w/o: 2474.39/2565.49/383.60) lat (ms,95%): 97.55 err/s 0.50 reconn/s: 0.00
[ 590s ] thds: 8 tps: 202.30 qps: 5492.52 (r/w/o: 2510.21/2577.71/404.60) lat (ms,95%): 80.03 err/s 1.10 reconn/s: 0.00
[ 600s ] thds: 8 tps: 194.50 qps: 5558.10 (r/w/o: 2538.90/2630.20/389.00) lat (ms,95%): 81.48 err/s 0.50 reconn/s: 0.00
[ 610s ] thds: 8 tps: 180.50 qps: 5316.90 (r/w/o: 2431.10/2524.80/361.00) lat (ms,95%): 150.29 err/s 0.90 reconn/s: 0.00
[ 620s ] thds: 8 tps: 191.60 qps: 5321.09 (r/w/o: 2424.40/2513.50/383.20) lat (ms,95%): 118.92 err/s 0.70 reconn/s: 0.00
[ 630s ] thds: 8 tps: 193.30 qps: 5565.10 (r/w/o: 2538.00/2640.50/386.60) lat (ms,95%): 86.00 err/s 0.50 reconn/s: 0.00
[ 640s ] thds: 8 tps: 195.40 qps: 5557.60 (r/w/o: 2535.90/2630.90/390.80) lat (ms,95%): 81.48 err/s 1.10 reconn/s: 0.00
[ 650s ] thds: 8 tps: 191.50 qps: 5401.76 (r/w/o: 2459.88/2558.88/383.00) lat (ms,95%): 99.33 err/s 1.40 reconn/s: 0.00
[ 660s ] thds: 8 tps: 189.80 qps: 5404.56 (r/w/o: 2464.58/2560.38/379.60) lat (ms,95%): 94.10 err/s 0.70 reconn/s: 0.00
[ 670s ] thds: 8 tps: 187.00 qps: 5344.25 (r/w/o: 2440.02/2530.23/374.00) lat (ms,95%): 90.78 err/s 0.70 reconn/s: 0.00
[ 680s ] thds: 8 tps: 184.00 qps: 5200.09 (r/w/o: 2369.79/2462.29/368.00) lat (ms,95%): 125.52 err/s 1.20 reconn/s: 0.00
[ 690s ] thds: 8 tps: 184.90 qps: 5257.96 (r/w/o: 2399.78/2488.38/369.80) lat (ms,95%): 110.66 err/s 1.00 reconn/s: 0.00
[ 700s ] thds: 8 tps: 188.50 qps: 5456.76 (r/w/o: 2489.98/2589.78/377.00) lat (ms,95%): 89.16 err/s 0.50 reconn/s: 0.00
[ 710s ] thds: 8 tps: 190.90 qps: 5438.36 (r/w/o: 2479.83/2576.73/381.80) lat (ms,95%): 90.78 err/s 0.90 reconn/s: 0.00
[ 720s ] thds: 8 tps: 176.90 qps: 5094.25 (r/w/o: 2329.38/2411.08/353.80) lat (ms,95%): 147.61 err/s 0.70 reconn/s: 0.00
[ 730s ] thds: 8 tps: 194.90 qps: 5618.38 (r/w/o: 2570.24/2658.34/389.81) lat (ms,95%): 81.48 err/s 0.70 reconn/s: 0.00
[ 740s ] thds: 8 tps: 191.80 qps: 5455.30 (r/w/o: 2485.40/2586.30/383.60) lat (ms,95%): 82.96 err/s 1.30 reconn/s: 0.00
[ 750s ] thds: 8 tps: 184.60 qps: 5376.45 (r/w/o: 2453.98/2553.28/369.20) lat (ms,95%): 95.81 err/s 0.80 reconn/s: 0.00
[ 760s ] thds: 8 tps: 189.80 qps: 5389.21 (r/w/o: 2458.60/2551.00/379.60) lat (ms,95%): 95.81 err/s 0.40 reconn/s: 0.00
[ 770s ] thds: 8 tps: 186.50 qps: 5321.12 (r/w/o: 2430.61/2517.51/373.00) lat (ms,95%): 95.81 err/s 1.10 reconn/s: 0.00
[ 780s ] thds: 8 tps: 192.00 qps: 5333.79 (r/w/o: 2432.59/2517.19/384.00) lat (ms,95%): 101.13 err/s 0.60 reconn/s: 0.00
[ 790s ] thds: 8 tps: 191.80 qps: 5494.33 (r/w/o: 2513.81/2596.91/383.60) lat (ms,95%): 84.47 err/s 1.20 reconn/s: 0.00
[ 800s ] thds: 8 tps: 196.50 qps: 5503.49 (r/w/o: 2508.30/2602.20/393.00) lat (ms,95%): 86.00 err/s 0.70 reconn/s: 0.00
[ 810s ] thds: 8 tps: 183.50 qps: 5232.29 (r/w/o: 2384.39/2480.89/367.00) lat (ms,95%): 121.08 err/s 0.90 reconn/s: 0.00
[ 820s ] thds: 8 tps: 178.70 qps: 5179.76 (r/w/o: 2367.28/2455.28/357.20) lat (ms,95%): 132.49 err/s 0.60 reconn/s: 0.00
[ 830s ] thds: 8 tps: 182.90 qps: 5339.86 (r/w/o: 2435.83/2538.03/366.00) lat (ms,95%): 104.84 err/s 0.80 reconn/s: 0.00
[ 840s ] thds: 8 tps: 185.90 qps: 5258.29 (r/w/o: 2394.50/2492.00/371.80) lat (ms,95%): 112.67 err/s 0.90 reconn/s: 0.00
[ 850s ] thds: 8 tps: 189.30 qps: 5298.81 (r/w/o: 2412.51/2507.71/378.60) lat (ms,95%): 95.81 err/s 0.90 reconn/s: 0.00
[ 860s ] thds: 8 tps: 192.80 qps: 5560.67 (r/w/o: 2529.59/2645.49/385.60) lat (ms,95%): 95.81 err/s 0.80 reconn/s: 0.00
[ 870s ] thds: 8 tps: 188.20 qps: 5364.80 (r/w/o: 2453.60/2534.80/376.40) lat (ms,95%): 90.78 err/s 0.80 reconn/s: 0.00
[ 880s ] thds: 8 tps: 188.90 qps: 5435.92 (r/w/o: 2477.81/2580.31/377.80) lat (ms,95%): 95.81 err/s 0.50 reconn/s: 0.00
[ 890s ] thds: 8 tps: 185.40 qps: 5543.12 (r/w/o: 2532.81/2639.51/370.80) lat (ms,95%): 90.78 err/s 0.60 reconn/s: 0.00
[ 900s ] thds: 8 tps: 184.80 qps: 5232.09 (r/w/o: 2380.00/2482.50/369.60) lat (ms,95%): 106.75 err/s 1.20 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2235571
        write:                           2320168
        other:                           344626
        total:                           4900365
    transactions:                        172301 (191.41 per sec.)
    queries:                             4900365 (5443.72 per sec.)
    ignored errors:                      764    (0.85 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          900.1863s
    total number of events:              172301

Latency (ms):
         min:                                    1.27
         avg:                                   41.79
         max:                                  423.40
         95th percentile:                       92.42
         sum:                              7199993.54

Threads fairness:
    events (avg/stddev):           21537.6250/139.72
    execution time (avg/stddev):   899.9992/0.06

2020-04-27T04:24:36Z